<?php
/**
 * @package Include/help/ja
 */
?>
<h1>マップビルダー</h1>

マップを作成するには、最初に次の項目を入力します。
<ul>
    <li>名前</li>
    <li>グループ</li>
    <li>背景画像</li>
</ul>
入力が完了したら「追加」をクリックします。するとマップがロードされます。
<br /><br />
マップにアイテムを追加するには、背景画像の下の「マップアイテム編集」フォームに入力します。
フォームには次の内容を入力します。
<ul>
    <li>ラベルと色</li>
    <li>種類:<br>
・状態を表すアイコン - 対象の状態に応じて色が変化するアイコンを表示します<br>
・モジュールデータのグラフ - モジュールが収集しているデータをグラフで表示します<br>
・値 - モジュールが収集している現在の値を表示します<br>
・パーセント(バー) - モジュールが収集している現在の値を棒グラフでパーセント表示します<br>
    </li>
    <li>マップに表示するエージェント</li>
    <li>マップに表示するモジュール</li>
    <li>更新間隔</li>
    <li>画像</li>
    <li>親クラス - 他のアイテムの子アイテムとして定義したい場合に指定します。</li>
    <li>リンク先マップ - アイテムを他のマップへリンクしたい場合に指定します</li>
</ul>
作成済みアイテムのプロパティを編集するには、マップ上のアイテムを「マップアイテム編集」にドラッグ&amp;ドロップします。
<br /><br />
アイテムを削除するには、「マップアイテム削除」から削除したいアイテムを選択し、「削除」をクリックします。
