<?php
/*
 * @package Include/help/ja
 */
?>

<h1>エディタ</h1>

<p>このタブは、ビジュアルコンソールエディタの多くの機能を持っています。ここで、要素を作成、編集、配置できます。これは動的なページで、ブラウザが javascript をサポートしている必要があります。画面ショットで見られるように、画面はボタンのあるボックスと作業領域(ビジュアルコンソールを描画する場所)の 2つに分割されています。
<ul class="list-type-disc mrgn_lft_20px">
        <li>ボタンボックス</li>
        <li>ワークエリア (ここで、ビジュアルコンソールを作成します)</li>
        <li>オプションパレット (画面ショットでは表示されていません)</li>
</ul>
<?php echo get_product_name(); ?> バージョン 5.0.1 では、テキストのラベルを設定できます。また、テキスト内に (_VALUE_) マクロを使って値を定義することができます。
</p>
