<?php
/**
 * @package Include/help/ja
 */
?>
<h1>アラート</h1>

<p>
<?php echo get_product_name(); ?> のアラートは、モジュールの値がしきい値を超えると動作します。アラート
では、管理者への e-mail や SMS 送信、SNMP トラップ送信、インシデント登録や Pando
ra FMS ログファイルへの記録等ができます。基本的に、<?php echo get_product_name(); ?> サーバを実行して
いる OS 上で実行できるスクリプトは何でも実行することができます。
</p>

<p>
新規アラートを作成するときは、以下のフィールドを入力する必要があります。
</p>

<ul>
    <li><b>エージェント名:</b> アラートを関連付けるエージェントの名前です。</li>
    <li><b>モジュール:</b> しきい値を超えたかどうかを確認するモジュールです。条件に合致すると、(e-mail 送信などの) イベントが発生します。
    <li><b>テンプレート:</b> パラメータが定義されたアラートです。管理者が簡単に設定するために利用します。</li>
    <li><b>アクション:</b> 設定されたアラートで選択すします。テンプレートで定義されたアクションを選択できます。</li>
    <li><b>閾値:</b> 最大回数を超えてアラートが発報されないことを保障する時間間隔を定義します。
</ul>
