<?php
/**
 * @package Include/help/ja
 */
?>
<h1>連続抑制タイムアウト</h1>

<br><br>

連続抑制回数が 0 より大きい場合、モジュールの状態変化が発生するには複数回値が変
化した状態になる必要があります。これは同期モジュールでは問題無く動きますが、非同期モジュールでは決まった間隔でデータが送信されないため、データ送られてくる間隔が大きく開いた場合に連続抑制は使い勝手がよくありません。このような場合、連続抑制タイムアウトを 0 より大きい値にすることにより、その時間内に連続抑制回数に達した場合という条件付けを行うことができます。

たとえば、非同期 proc モジュールにおいて、連続抑制回数が 1 で連続抑制タイムアウトが 600(10分) の場合は次のようになります。

<br><br>
<table>
<th>時間</th>
<th>データ</th>
<th>状態変化</th>
<tr>
    <td>12:00</td>
    <td>1</td>
    <td>No</td>
</tr>
<tr>
    <td>12:05</td>
    <td>0</td>
    <td>No</td>
</tr>
<tr>
    <td><b>12:20</b></td>
    <td>0</td>
    <td>No</td>
</tr>
<tr>
    <td>12:25</b></td>
    <td>1</td>
    <td>No</td>
</tr>
<tr>
    <td>12:45</td>
    <td>0</td>
    <td>No</td>
</tr>
<tr>
    <td><b>12:50</b></td>
    <td>0</td>
    <td><b>Yes</b></td>
</tr>
</table>

<br><br>

