<?php
/**
 * @package Include/help/ja
 */
?>
<h1>一括操作</h1>

このツールでは、さまざまな一括操作ができます:<br><br>

<ul>
<li> 1つのエージェントから他のエージェントへの、モジュールのコピーやアラート設定のコピー
</li>
<li> エージェントグループからのモジュールやアラートの削除</li>
<li> 選択したエージェントの全削除</li>
</ul>

<h2> コピー</h2>

<p>
1つのエージェントに設定されている、モジュールおよびアラート設定を他のエージェントにコピーします。
</p>

<ol>
<li> コピー元グループを選択します。</li>
<li> コピー元エージェントを選択します。</li>
<li> コピー元エージェントから、1つ以上のモジュールを選択します。</li>
<li> コピー先エージェントを選択します。</li>
<li> 対象を選択します。: コピーするモジュール、コピーするアラート(もし、コピー先エージェントに同じ名前のモジュールが無い場合は、コピーできません。)
モジュールのコピーおよびアラートのコピー両方可能です。
</li>
<li> 「実行」ボタンをクリックします。</li>
</ol>

<h2> モジュールの編集</h2>

<p>
モジュール設定を編集します。
</p>

<ol>
<li> モジュールタイプおよび、モジュール名を選択します。</li>
<li> エージェントグループを選択します。</li>
<li> エージェントを選択します。</li>
<li> モジュールの詳細パラメータを設定します。</li>
<li> 「更新」ボタンをクリックします。</li>
</ol>

<h2> モジュール削除</h2>

<p>
選択されたエージェントのモジュールを削除します。
</p>

<ol>
<li> グループを選択します。 </li>
<li> エージェントを選択します。</li>
<li> 1つ以上のモジュールを選択します。</li>
<li> 「削除」ボタンをクリックします。
</ol>

<h2> エージェント削除</h2>

<p>
エージェントの全設定(モジュール、アラート、イベント等)を削除します。
</p>

<ol>
<li> グループを選択します。</li>
<li> エージェントを選択します。</li>
<li> 「削除」ボタンをクリックします。</li>
</ol>

<h2> アラート削除</h2>

<p>
アラート設定を削除します。
</p>

<ol>
<li> アラートを選択します。</li>
<li> グループを選択します。</li>
<li> エージェントを選択します。</li>
<li> 「削除」ボタンをクリックします。</li>
</ol>
